# INGENIERÍA DE SISTEMAS DE INFORMACIÓN

## EJERCICIOS DISEÑO CONCEPTUAL MEDIANTE DIAGRAMAS ENTIDAD RELACIÓN Y MODELO RELACIONAL.

# Ejercicio 3: Diseño del diagrama ER para una compañia

<img src="EJ3_Parte2.jpg">

In [1]:
%reload_ext sql

/Users/SergioCobos/anaconda3/lib/python3.6/site-packages/IPython/config.py:13: ShimWarning: The `IPython.config` package has been deprecated since IPython 4.0. You should import from traitlets.config instead.
  "You should import from traitlets.config instead.", ShimWarning)
/Users/SergioCobos/anaconda3/lib/python3.6/site-packages/sql/magic.py:4: UserWarning: IPython.utils.traitlets has moved to a top-level traitlets package.
  from IPython.utils.traitlets import Bool, Int, Unicode

In [2]:
%%sql
sqlite:///ISI-DIAGRAMAS-ER-EJERCICIO-e3.db

'Connected: None@ISI-DIAGRAMAS-ER-EJERCICIO-e3.db'

In [10]:
%sql PRAGMA foreign_keys = ON;

Done.

[]

In [11]:
%%sql

DROP TABLE IF EXISTS Empleados;

CREATE TABLE Empleados(nif VARCHAR(10),
                      salario FLOAT,
                      telefono INT,
                      PRIMARY KEY(nif));

Done.
Done.

[]

In [12]:
%%sql

DROP TABLE IF EXISTS Hijos;

CREATE TABLE Hijos(nombre VARCHAR(20),
                    edad INT,
                    nif_empleado VARCHAR(10) NOT NULL,
                    PRIMARY KEY(nombre, nif_empleado),
                    FOREIGN KEY(nif_empleado) REFERENCES Empleados(nif) ON DELETE CASCADE
                    );

Done.
Done.

[]

In [13]:
%%sql

DROP TABLE IF EXISTS Departamentos_Dirigidos;

CREATE TABLE Departamentos_Dirigidos(id_dpto INT,
                                    nombre_dpto VARCHAR(20),
                                    presupuesto FLOAT,
                                    nif VARCHAR(10) NOT NULL,
                                    PRIMARY KEY(id_dpto),
                                    FOREIGN KEY (nif) REFERENCES Empleados(nif));

Done.
Done.

[]

In [14]:
%%sql 

DROP TABLE IF EXISTS Trabajan;

CREATE TABLE Trabajan( id_dpto INT,
                     nif VARCHAR(10),
                     PRIMARY KEY(id_dpto, nif),
                     FOREIGN KEY (id_dpto) REFERENCES Departamentos_Dirigidos(id_dpto),
                     FOREIGN KEY(nif) REFERENCES Empleados(nif));

Done.
Done.

[]

In [15]:
%%sql
INSERT INTO Empleados(nif, salario, telefono)
    VALUES('123456789N', 25000, 665999999);

1 rows affected.

[]

In [16]:
%%sql
INSERT INTO Empleados(nif, salario, telefono)
    VALUES('444456789N', 28000, 665009000);

1 rows affected.

[]

In [20]:
%%sql
INSERT INTO Departamentos_Dirigidos(id_dpto,nombre_dpto, presupuesto, nif)
    VALUES(1,'Logistica',10000,'444456789N');

1 rows affected.

[]

In [21]:
%%sql
INSERT INTO Hijos(nombre, edad, nif_empleado)
    VALUES('Sergio', 21, '444456789N');

1 rows affected.

[]

In [22]:
%sql SELECT * FROM Hijos

Done.

[('Sergio', 21, '444456789N')]

In [25]:
%sql SELECT * FROM Departamentos_Dirigidos

Done.

[(1, 'Logistica', 10000.0, '444456789N')]

In [26]:
%sql SELECT * FROM Empleados

Done.

[('123456789N', 25000.0, 665999999), ('444456789N', 28000.0, 665009000)]

In [27]:
%%sql
INSERT INTO Hijos(nombre, edad, nif_empleado)
    VALUES('Cayetana', 21, '123456789N');

1 rows affected.

[]

In [30]:
%%sql
INSERT INTO Departamentos_Dirigidos(id_dpto,nombre_dpto, presupuesto, nif)
    VALUES(2,'Administracion',50000,'123456789N');

1 rows affected.

[]

In [31]:
%%sql
INSERT INTO Empleados(nif, salario, telefono)
    VALUES('111111111Z', 18000, 666444555);

1 rows affected.

[]

In [32]:
%%sql
INSERT INTO Empleados(nif, salario, telefono)
    VALUES('333333333Z', 12000, 666000333);

1 rows affected.

[]

In [40]:
%%sql
SELECT *
FROM Empleados
INNER JOIN Departamentos_Dirigidos 
ON Empleados.nif = Departamentos_Dirigidos.nif

Done.

[('444456789N', 28000.0, 665009000, 1, 'Logistica', 10000.0, '444456789N'),
 ('123456789N', 25000.0, 665999999, 2, 'Administracion', 50000.0, '123456789N')]

In [42]:
%%sql
SELECT *
FROM Empleados
INNER JOIN Hijos 
ON Empleados.nif = Hijos.nif_empleado

Done.

[('444456789N', 28000.0, 665009000, 'Sergio', 21, '444456789N'),
 ('123456789N', 25000.0, 665999999, 'Cayetana', 21, '123456789N')]

In [44]:
%%sql
SELECT *
FROM Empleados
ORDER BY Salario DESC

Done.

[('444456789N', 28000.0, 665009000),
 ('123456789N', 25000.0, 665999999),
 ('111111111Z', 18000.0, 666444555),
 ('333333333Z', 12000.0, 666000333)]

In [53]:
%%sql
SELECT *
FROM Empleados
WHERE Salario < 20000 AND Salario > 13000

Done.

[('111111111Z', 18000.0, 666444555)]

In [47]:
%%sql
SELECT *
FROM Empleados
ORDER BY Salario DESC LIMIT 2

Done.

[('444456789N', 28000.0, 665009000), ('123456789N', 25000.0, 665999999)]